doc/log/0001_Make-It-Useful.org
#+TITLE: Make It Useful: Lazy, Links and Publish

[2020-11-07 Sat]

* Bug/Feature #1: It works, but why?

This is very odd, but it seems the compiler cannot handle a global variable that is not known?

As "luck" would have it, because I literate program, the ~Index.vue~ was tangled twice. The first script and template tags are in fact ignored by the vuejs it seems, yet the compiler seems to take the first script tag into account when linting and/or link checking.

In other words, it seems that the last method fails to compile.

#+begin_src javascript
    sourceCodeRun (id) {
      var val = g_sourceCodeRun(id)
      alert('=> ' + val)
    }
#+end_src

That errors with ~40:17 error 'g_sourceCodeRun' is not defined no-undef~.

But, if I add an empty script tag before the one that actually runs in the
~Index.vue~, it compiles and runs.

#+begin_src vue

<script> </script>
<script>
  // [...]
   sourceCodeRun (id) {
      var val = g_sourceCodeRun(id)
      alert('=> ' + val)
    }
  // [...]
</script>
#+end_src

Now, I like lint. Just ask my navel. So, perhaps I should import/export it.

#+begin_src scheme :tangle ../../gx/lazy-gambit-repl.ss
(import :gerbil/gambit)
(declare (extended-bindings))

(##inline-host-statement
 "exports.evalElement = (arg) => {
  alert('Lazy? Hello ' + arg)
}"
)

(define (document.getElementById id)
  (##inline-host-expression "g_host2foreign(document.getElementById(g_scm2host(@1@)))" id))

(define (Element.innerText-ref elem)
  (##inline-host-expression "g_host2scm(g_foreign2host(@1@).innerText)" elem))

(define (g-sourceCodeRun id)
  (let* ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (let ((expr (cons '##begin (with-input-from-string code read-all))))
      (eval expr))

    ))

(##inline-host-declaration "g_sourceCodeRun = function () { alert('sourceCodeRun'); };")

(##inline-host-statement "
g_sourceCodeRun = g_scm2host(@1@);
exports.sourceCodeRun = g_sourceCodeRun;" g-sourceCodeRun)

#+end_src


Now, with the import, everything should work as expected. We also needed to change the exported name to camelCase. Lint!

  : import { sourceCodeRun } from 'app/public/gambit-repl.js'





