log/0001_Make-It-Useful.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-25 Wed 11:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Make It Useful: Lazy, Links and Publish</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Drew Crampsie" />
</head>
<body>
<div id="content">
<h1 class="title">Make It Useful: Lazy, Links and Publish</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc3ecafc">1. Bug/Feature #1: It works, but why?</a></li>
<li><a href="#org4b5fd18">2. Links</a>
<ul>
<li><a href="#org4c8a767">2.1. <code>gambit-module-test.ss</code>: A module not loaded in the gambit program</a></li>
<li><a href="#orge330598">2.2. The new <code>Index.vue</code></a></li>
<li><a href="#org6988dcc">2.3. <code>MainLayout.vue</code>: Our links please!</a></li>
</ul>
</li>
<li><a href="#orga8027ba">3. <code>build.sh</code>: A simple build script</a></li>
<li><a href="#orgcdc2c51">4. Commit, build, commit, deploy</a></li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-11-07 Sat]</span></span>
</p>

<div id="outline-container-orgc3ecafc" class="outline-2">
<h2 id="orgc3ecafc"><span class="section-number-2">1</span> Bug/Feature #1: It works, but why?</h2>
<div class="outline-text-2" id="text-1">
<p>
This is very odd, but it seems the compiler cannot handle a global variable that is not known?
</p>

<p>
As &ldquo;luck&rdquo; would have it, because I literate program, the <code>Index.vue</code> was tangled twice. The first script and template tags are in fact ignored by the vuejs it seems, yet the compiler seems to take the first script tag into account when linting and/or link checking.
</p>

<p>
In other words, it seems that the last method fails to compile.
</p>

<div class="org-src-container">
<pre class="src src-javascript">    sourceCodeRun (id) {
      <span style="color: #51afef;">var</span> <span style="color: #dcaeea;">val</span> = g_sourceCodeRun(id)
      alert(<span style="color: #98be65;">'=&gt; '</span> + val)
    }
</pre>
</div>

<p>
That errors with <code>40:17 error 'g_sourceCodeRun' is not defined no-undef</code>.
</p>

<p>
But, if I add an empty script tag before the one that actually runs in the
<code>Index.vue</code>, it compiles and runs.
</p>

<div class="org-src-container">
<pre class="src src-vue">
&lt;<span style="color: #c678dd;">script</span>&gt; &lt;/<span style="color: #c678dd;">script</span>&gt;
&lt;<span style="color: #c678dd;">script</span>&gt;
  // [...]
   sourceCodeRun (id) {
      var val = g_sourceCodeRun(id)
      alert('=&gt; ' + val)
    }
  // [...]
&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>

<p>
Now, I like lint. Just ask my navel. So, perhaps I should import/export it.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">import</span> <span style="color: #c678dd;">:gerbil/gambit</span>)
(<span style="color: #51afef;">declare</span> (extended-bindings))

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.evalElement = (arg) =&gt; {</span>
<span style="color: #98be65;">  alert('Lazy? Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>
)

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">document.getElementById</span> id)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2foreign(document.getElementById(g_scm2host(@1@)))"</span> id))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">Element.innerText-ref</span> elem)
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_host2scm(g_foreign2host(@1@).innerText)"</span> elem))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">g-sourceCodeRun</span> id)
  (<span style="color: #51afef;">let*</span> ((elem (document.getElementById id))
         (code (Element.innerText-ref elem)))
    (<span style="color: #51afef;">let</span> ((expr (cons <span style="color: #51afef;">'</span><span style="color: #c678dd;">##</span>begin (with-input-from-string code read-all))))
      (<span style="color: #51afef;">eval</span> expr))

    ))

(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"g_sourceCodeRun = function () { alert('sourceCodeRun'); };"</span>)

(<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"</span>
<span style="color: #98be65;">g_sourceCodeRun = g_scm2host(@1@);</span>
<span style="color: #98be65;">exports.sourceCodeRun = g_sourceCodeRun;"</span> g-sourceCodeRun)

</pre>
</div>


<p>
Now, with the import, everything should work as expected. We also needed to change the exported name to camelCase. Lint!
</p>

<pre class="example">
import { sourceCodeRun } from 'app/public/gambit-repl.js'
</pre>
</div>
</div>
