doc/log/0001_Make-It-Useful.org
* Links

In the ~MainLayout.vue~ there is a series of link on the menu.

#+begin_src javascript
const linksData = [
  {
    title: 'Docs',
    caption: 'quasar.dev',
    icon: 'school',
    link: 'https://quasar.dev'
  },
  {
    title: 'Github',
    caption: 'github.com/quasarframework',
    icon: 'code',
    link: 'https://github.com/quasarframework'
  },
  // [...]
  {
    title: 'Quasar Awesome',
    caption: 'Community Quasar projects',
    icon: 'favorite',
    link: 'https://awesome.quasar.dev'
  }
]
#+end_src

I'm going to make that into a ~plist~ and then have ~plist->jso~ function that
does what we want.

This took a lot longer than expected as ~Gerbil + Gambit + our runtime = ???~
and we were questioning for sure. A few re-writes are needed.


Making a host object seems easy. Because in ~js~ almost everything is an
~object~, *Gambit* allows us to, at least at certain times(!), set a vector
using a keyword as the index which creates a ~js~ object with those fields.

We'll do so and copy it to make it an object that is not an array.

#+begin_src scheme :noweb-ref plist->jso
(def (plist->jso plist)
  (def jso (##make-vector 0))
  (def (p->o p)
    (if (null? p) jso
        (begin ; (console.log p)
               (set! jso (##vector-set!
                          jso (car p)
                          (##inline-host-expression "g_scm2host(@1@);" (cadr p))))
               (p->o (cddr p)))))
  (##inline-host-expression "Object.fromEntries(Object.entries(@1@));" (p->o plist)))
#+end_src

What if we actually want a ~##vector~ but have a list?

It seems that ~length~ and/or ~##length~ does not exist in our runtime. We'll
certainly need it at some point, so we'll define our own.

#+begin_src scheme :noweb-ref length
(def (length lst)
  (if (null? lst) 0 (+ 1 (length (##cdr lst)))))
#+end_src

Same for ~##list->vector~ and friend. The ~##~ prefix is notable.

#+begin_src scheme :noweb-ref list->vector
(def (list->vector lst)
  (def n (##length lst))
  (def vec (##make-vector n))

  (let loop ((i 0) (l lst))
    (if (not (null? l))
      (begin
        (##vector-set! vec i (##car l))
        (loop (+ i 1) (##cdr l)))))
  vec)
#+end_src

Because we are defining them, using ~def~, a *Gerbil* form, and without the ~##~
prefix, we need to specify the ~namespace:~. *Gerbil* and *Gambit* use the ~#~
sign as the separator.

For example, in ~static/lazy-gambit-repl.scm~, which is a generated/transpiled scheme file
from our version, the symbols defined all have a prefix.

#+begin_src scheme
(define lazy-gambit-repl#g-sourceCodeRun
    (lambda (_id389_)
      (let* ((_elem391_ (lazy-gambit-repl#document.getElementById _id389_))
             (_code393_ (lazy-gambit-repl#Element.innerText-ref _elem391_)))
  [...])
#+end_src

*Gerbil* has a ~namespace:~ keyword that, when placed at the toplevel,
interprets definitions, along with usage of those defined symbols, in that
namespace.

It seems that *Gambit* has ~##~ as the prefix for primatives. We can use that to
cheat our way.

#+begin_src scheme
namespace: "#"
#+end_src

Using that keyword at the top makes the namespace ~#~ and the separator ~#~. So
our symbols are ~##~ prefixed like the gambit primatives.

Now a simply dynamic module that gives us an exported object.

#+begin_src scheme :tangle ../../gx/hello.ss
(declare (extended-bindings))
(extern namespace: "#" plist->jso list->vector)
(extern namespace: "#" alert)
(def linksData
  '((title: "Gerbil Docs" caption: "cons.io" icon: "school" link: "https://cons.io")
    (title: "Quasar Docs" caption: "quasar.dev" icon: "school" link: "https://quasar.dev")))


(##inline-host-statement
 " exports.links = (@1@);"
 (list->vector (map plist->jso linksData)))


(##inline-host-statement
 "exports.Hello = (arg) => {
   var hello_fn = g_scm2host(@1@)
   hello_fn('Hello ' + arg)
}"
 (lambda (str) (alert str)))
#+end_src

#+begin_src scheme :tangle ../../gx/gxjs-rt.ss :noweb yes
namespace: "#"
(declare (extended-bindings))
(declare (not inline))

(def (alert thing) (##inline-host-statement "var foo = (@1@);
  var bar = typeof foo === 'string' ? foo : g_scm2host(foo)
  alert(bar);" thing))
(def (console.log obj) (##inline-host-statement "console.log((@1@))" obj))

;; (define (apply proc arg1 . rest)
;;   (if (##pair? rest)

;;       (let loop ((prev arg1) (lst rest))
;;         (let ((temp (##car lst)))
;;           (##set-car! lst prev)
;;           (let ((tail (##cdr lst)))
;;             (if (##pair? tail)
;;                 (loop temp tail)
;;                 (begin
;;                   (##set-cdr! lst temp)
;;                   (##apply proc rest))))))

;;       (##apply proc arg1)))

<<plist->jso>>

<<length>>

<<list->vector>>

(def (gambit-module-name mod)
  (def obj (##vector-ref (##vector-ref mod 0) 0))
  (##inline-host-expression "(@1@).name" obj))

(def (init-gambit-module mod)
  (let ((init (##vector-ref mod 4)))
    (if (not (##procedure? init)) (error "No init for " mod)
      (init))))

(define (init-gambit-program)
  (declare (extended-bindings) (not safe))
    (let ((mods (##vector-ref ##program-descr 0)))
      (let loop ((i 1)) ;; start at module after the current one
        (if (##fx< i (##vector-length mods))
            (let ((mod (##vector-ref mods i)))
              (init-gambit-module mod) ;; call module's init procedure
              (loop (##fx+ i 1)))))))

(init-gambit-program)

(##inline-host-declaration "
gx_old_module_register = g_module_register;

gx_gambit_module_table = [];

gx_gambit_module_init = function (m) { alert('gx_gambit_module_init undefined') }

gx_gambit_module_register = function (module_descr) {
  gx_gambit_module_table.push(module_descr);
  typeof g_glo['##program-descr'] === 'object' ? gx_gambit_module_init(module_descr)
    : gx_old_module_register(module_descr)
}

g_module_register = gx_gambit_module_register;

// console.log(g_module_register);
")

(##inline-host-statement "gx_gambit_module_init = (g_scm2host(@1@)); " (lambda (mod) (init-gambit-module mod)))
#+end_src

