log/0001_Make-It-Useful.html


<div id="outline-container-org4b5fd18" class="outline-2">
<h2 id="org4b5fd18"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<p>
In the <code>MainLayout.vue</code> there is a series of link on the menu.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #51afef;">const</span> <span style="color: #dcaeea;">linksData</span> = [
  {
    title: <span style="color: #98be65;">'Docs'</span>,
    caption: <span style="color: #98be65;">'quasar.dev'</span>,
    icon: <span style="color: #98be65;">'school'</span>,
    link: <span style="color: #98be65;">'https://quasar.dev'</span>
  },
  {
    title: <span style="color: #98be65;">'Github'</span>,
    caption: <span style="color: #98be65;">'github.com/quasarframework'</span>,
    icon: <span style="color: #98be65;">'code'</span>,
    link: <span style="color: #98be65;">'https://github.com/quasarframework'</span>
  },
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[...]</span>
  {
    title: <span style="color: #98be65;">'Quasar Awesome'</span>,
    caption: <span style="color: #98be65;">'Community Quasar projects'</span>,
    icon: <span style="color: #98be65;">'favorite'</span>,
    link: <span style="color: #98be65;">'https://awesome.quasar.dev'</span>
  }
]
</pre>
</div>

<p>
I&rsquo;m going to make that into a <code>plist</code> and then have <code>plist-&gt;jso</code> function that
does what we want.
</p>

<p>
This took a lot longer than expected as <code>Gerbil + Gambit + our runtime = ???</code>
and we were questioning for sure. A few re-writes are needed.
</p>


<p>
Making a host object seems easy. Because in <code>js</code> almost everything is an
<code>object</code>, <b>Gambit</b> allows us to, at least at certain times(!), set a vector
using a keyword as the index which creates a <code>js</code> object with those fields.
</p>

<p>
We&rsquo;ll do so and copy it to make it an object that is not an array.
</p>

<a name="plist->jso"></a>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">plist-&gt;jso</span> plist)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">jso</span> (<span style="color: #c678dd;">##</span>make-vector 0))
  (<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">p-&gt;o</span> p)
    (<span style="color: #51afef;">if</span> (null? p) jso
        (<span style="color: #51afef;">begin</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">(console.log p)</span>
               (<span style="color: #51afef;">set!</span> jso (<span style="color: #c678dd;">##</span>vector-set!
                          jso (car p)
                          (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_scm2host(@1@);"</span> (cadr p))))
               (p-&gt;o (cddr p)))))
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"Object.fromEntries(Object.entries(@1@));"</span> (p-&gt;o plist)))
</pre>
</div>

<p>
What if we actually want a <code>##vector</code> but have a list?
</p>

<p>
It seems that <code>length</code> and/or <code>##length</code> does not exist in our runtime. We&rsquo;ll
certainly need it at some point, so we&rsquo;ll define our own.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">length</span> lst)
  (<span style="color: #51afef;">if</span> (null? lst) 0 (+ 1 (length (<span style="color: #c678dd;">##</span>cdr lst)))))
</pre>
</div>

<p>
Same for <code>##list-&gt;vector</code> and friend. The <code>##</code> prefix is notable.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">list-&gt;vector</span> lst)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">n</span> (<span style="color: #c678dd;">##</span>length lst))
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">vec</span> (<span style="color: #c678dd;">##</span>make-vector n))

  (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> ((i 0) (l lst))
    (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (null? l))
      (<span style="color: #51afef;">begin</span>
        (<span style="color: #c678dd;">##</span>vector-set! vec i (<span style="color: #c678dd;">##</span>car l))
        (loop (+ i 1) (<span style="color: #c678dd;">##</span>cdr l)))))
  vec)
</pre>
</div>

<p>
Because we are defining them, using <code>def</code>, a <b>Gerbil</b> form, and without the <code>##</code>
prefix, we need to specify the <code>namespace:</code>. <b>Gerbil</b> and <b>Gambit</b> use the <code>#</code>
sign as the separator.
</p>

<p>
For example, in <code>static/lazy-gambit-repl.scm</code>, which is a generated/transpiled scheme file
from our version, the symbols defined all have a prefix.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">define</span> <span style="color: #c678dd;">lazy-gambit-repl#g-sourceCodeRun</span>
    (<span style="color: #51afef;">lambda</span> (<span style="color: #c678dd;">_</span>id389<span style="color: #c678dd;">_</span>)
      (<span style="color: #51afef;">let*</span> ((<span style="color: #c678dd;">_</span>elem391<span style="color: #c678dd;">_</span> (lazy-gambit-repl<span style="color: #c678dd;">#</span>document.getElementById <span style="color: #c678dd;">_</span>id389<span style="color: #c678dd;">_</span>))
             (<span style="color: #c678dd;">_</span>code393<span style="color: #c678dd;">_</span> (lazy-gambit-repl<span style="color: #c678dd;">#</span>Element.innerText-ref <span style="color: #c678dd;">_</span>elem391<span style="color: #c678dd;">_</span>)))
  <span style="color: #dcaeea;">[</span><span style="color: #c678dd;">...</span><span style="color: #dcaeea;">]</span>)
</pre>
</div>

<p>
<b>Gerbil</b> has a <code>namespace:</code> keyword that, when placed at the toplevel,
interprets definitions, along with usage of those defined symbols, in that
namespace.
</p>

<p>
It seems that <b>Gambit</b> has <code>##</code> as the prefix for primatives. We can use that to
cheat our way.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> <span style="color: #98be65;">"#"</span>
</pre>
</div>

<p>
Using that keyword at the top makes the namespace <code>#</code> and the separator <code>#</code>. So
our symbols are <code>##</code> prefixed like the gambit primatives.
</p>

<p>
Now a simply dynamic module that gives us an exported object.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">declare</span> (extended-bindings))
(<span style="color: #51afef;">extern</span> <span style="color: #c678dd;">namespace:</span> <span style="color: #98be65;">"#"</span> plist-&gt;jso list-&gt;vector)
(<span style="color: #51afef;">extern</span> <span style="color: #c678dd;">namespace:</span> <span style="color: #98be65;">"#"</span> alert)
(<span style="color: #51afef;">def</span> <span style="color: #c678dd;">linksData</span>
  <span style="color: #51afef;">'</span>((<span style="color: #c678dd;">title:</span> <span style="color: #98be65;">"Gerbil Docs"</span> <span style="color: #c678dd;">caption:</span> <span style="color: #98be65;">"cons.io"</span> <span style="color: #c678dd;">icon:</span> <span style="color: #98be65;">"school"</span> <span style="color: #c678dd;">link:</span> <span style="color: #98be65;">"https://cons.io"</span>)
    (<span style="color: #c678dd;">title:</span> <span style="color: #98be65;">"Quasar Docs"</span> <span style="color: #c678dd;">caption:</span> <span style="color: #98be65;">"quasar.dev"</span> <span style="color: #c678dd;">icon:</span> <span style="color: #98be65;">"school"</span> <span style="color: #c678dd;">link:</span> <span style="color: #98be65;">"https://quasar.dev"</span>)))


(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">" exports.links = (@1@);"</span>
 (list-&gt;vector (<span style="color: #51afef;">map</span> plist-&gt;jso linksData)))


(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Hello = (arg) =&gt; {</span>
<span style="color: #98be65;">   var hello_fn = g_scm2host(@1@)</span>
<span style="color: #98be65;">   hello_fn('Hello ' + arg)</span>
<span style="color: #98be65;">}"</span>
 (<span style="color: #51afef;">lambda</span> (str) (alert str)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #c678dd;">namespace:</span> <span style="color: #98be65;">"#"</span>
(<span style="color: #51afef;">declare</span> (extended-bindings))
(<span style="color: #51afef;">declare</span> (<span style="color: #51afef;">not</span> inline))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">alert</span> thing) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"var foo = (@1@);</span>
<span style="color: #98be65;">  var bar = typeof foo === 'string' ? foo : g_scm2host(foo)</span>
<span style="color: #98be65;">  alert(bar);"</span> thing))
(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">console.log</span> obj) (<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"console.log((@1@))"</span> obj))

<span style="color: #5B6268;">;; </span><span style="color: #5B6268;">(define (apply proc arg1 . rest)</span>
<span style="color: #5B6268;">;;   </span><span style="color: #5B6268;">(if (##pair? rest)</span>

<span style="color: #5B6268;">;;       </span><span style="color: #5B6268;">(let loop ((prev arg1) (lst rest))</span>
<span style="color: #5B6268;">;;         </span><span style="color: #5B6268;">(let ((temp (##car lst)))</span>
<span style="color: #5B6268;">;;           </span><span style="color: #5B6268;">(##set-car! lst prev)</span>
<span style="color: #5B6268;">;;           </span><span style="color: #5B6268;">(let ((tail (##cdr lst)))</span>
<span style="color: #5B6268;">;;             </span><span style="color: #5B6268;">(if (##pair? tail)</span>
<span style="color: #5B6268;">;;                 </span><span style="color: #5B6268;">(loop temp tail)</span>
<span style="color: #5B6268;">;;                 </span><span style="color: #5B6268;">(begin</span>
<span style="color: #5B6268;">;;                   </span><span style="color: #5B6268;">(##set-cdr! lst temp)</span>
<span style="color: #5B6268;">;;                   </span><span style="color: #5B6268;">(##apply proc rest))))))</span>

<span style="color: #5B6268;">;;       </span><span style="color: #5B6268;">(##apply proc arg1)))</span>

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">plist-&gt;jso</span> plist)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">jso</span> (<span style="color: #c678dd;">##</span>make-vector 0))
  (<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">p-&gt;o</span> p)
    (<span style="color: #51afef;">if</span> (null? p) jso
        (<span style="color: #51afef;">begin</span> <span style="color: #5B6268;">; </span><span style="color: #5B6268;">(console.log p)</span>
               (<span style="color: #51afef;">set!</span> jso (<span style="color: #c678dd;">##</span>vector-set!
                          jso (car p)
                          (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"g_scm2host(@1@);"</span> (cadr p))))
               (p-&gt;o (cddr p)))))
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"Object.fromEntries(Object.entries(@1@));"</span> (p-&gt;o plist)))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">length</span> lst)
  (<span style="color: #51afef;">if</span> (null? lst) 0 (+ 1 (length (<span style="color: #c678dd;">##</span>cdr lst)))))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">list-&gt;vector</span> lst)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">n</span> (<span style="color: #c678dd;">##</span>length lst))
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">vec</span> (<span style="color: #c678dd;">##</span>make-vector n))

  (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> ((i 0) (l lst))
    (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (null? l))
      (<span style="color: #51afef;">begin</span>
        (<span style="color: #c678dd;">##</span>vector-set! vec i (<span style="color: #c678dd;">##</span>car l))
        (loop (+ i 1) (<span style="color: #c678dd;">##</span>cdr l)))))
  vec)

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">gambit-module-name</span> mod)
  (<span style="color: #51afef;">def</span> <span style="color: #c678dd;">obj</span> (<span style="color: #c678dd;">##</span>vector-ref (<span style="color: #c678dd;">##</span>vector-ref mod 0) 0))
  (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"(@1@).name"</span> obj))

(<span style="color: #51afef;">def</span> (<span style="color: #c678dd;">init-gambit-module</span> mod)
  (<span style="color: #51afef;">let</span> ((init (<span style="color: #c678dd;">##</span>vector-ref mod 4)))
    (<span style="color: #51afef;">if</span> (<span style="color: #51afef;">not</span> (<span style="color: #c678dd;">##</span>procedure? init)) (<span style="color: #51afef;">error</span> <span style="color: #98be65;">"No init for "</span> mod)
      (init))))

(<span style="color: #51afef;">define</span> (<span style="color: #c678dd;">init-gambit-program</span>)
  (<span style="color: #51afef;">declare</span> (extended-bindings) (<span style="color: #51afef;">not</span> safe))
    (<span style="color: #51afef;">let</span> ((mods (<span style="color: #c678dd;">##</span>vector-ref <span style="color: #c678dd;">##</span>program-descr 0)))
      (<span style="color: #51afef;">let</span> <span style="color: #c678dd;">loop</span> ((i 1)) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">start at module after the current one</span>
        (<span style="color: #51afef;">if</span> (<span style="color: #c678dd;">##</span>fx&lt; i (<span style="color: #c678dd;">##</span>vector-length mods))
            (<span style="color: #51afef;">let</span> ((mod (<span style="color: #c678dd;">##</span>vector-ref mods i)))
              (init-gambit-module mod) <span style="color: #5B6268;">;; </span><span style="color: #5B6268;">call module's init procedure</span>
              (loop (<span style="color: #c678dd;">##</span>fx+ i 1)))))))

(init-gambit-program)

(<span style="color: #c678dd;">##</span>inline-host-declaration <span style="color: #98be65;">"</span>
<span style="color: #98be65;">gx_old_module_register = g_module_register;</span>

<span style="color: #98be65;">gx_gambit_module_table = [];</span>

<span style="color: #98be65;">gx_gambit_module_init = function (m) { alert('gx_gambit_module_init undefined') }</span>

<span style="color: #98be65;">gx_gambit_module_register = function (module_descr) {</span>
<span style="color: #98be65;">  gx_gambit_module_table.push(module_descr);</span>
<span style="color: #98be65;">  typeof g_glo['##program-descr'] === 'object' ? gx_gambit_module_init(module_descr)</span>
<span style="color: #98be65;">    : gx_old_module_register(module_descr)</span>
<span style="color: #98be65;">}</span>

<span style="color: #98be65;">g_module_register = gx_gambit_module_register;</span>

<span style="color: #98be65;">// console.log(g_module_register);</span>
<span style="color: #98be65;">"</span>)

(<span style="color: #c678dd;">##</span>inline-host-statement <span style="color: #98be65;">"gx_gambit_module_init = (g_scm2host(@1@)); "</span> (<span style="color: #51afef;">lambda</span> (mod) (init-gambit-module mod)))
</pre>
</div>
</div>
