doc/log/0001_Make-It-Useful.org
** ~gambit-module-test.ss~: A module not loaded in the gambit program

#+begin_src scheme :tangle ../../gx/gambit-module-test.ss
(declare (extended-bindings))
(extern namespace: "#" alert console.log plist->jso)

(##inline-host-statement
 "exports.Test = (arg) => {
   var hello_fn = g_scm2host(@1@)
   hello_fn('Test' + arg)
}"
 (lambda (str)
   (let* ((mod (##inline-host-expression "gx_gambit_module_table[1];"))
          (name (##gambit-module-name mod)))
     (console.log mod)

     (alert str) (alert name))))
#+end_src

**  The new ~Index.vue~

This is what we end up with for the index page. Because we lazy-load gambit we want to inform the user of such. The [[https://quasar.dev/quasar-plugins/loading#Loading-API][Loading Plugin]] for *Quasar* is good enough.

#+begin_src javascript
// quasar.conf.js

return {
  framework: {
    plugins: [
      'Loading'
    ],
    config: {
      loading: {
        delay: 300,
        message: 'Loading API...'
      }
    }
  }
}
#+end_src

#+begin_src vue :tangle ../../src/pages/Index.vue
<template>
  <q-page class="flex flex-center">
    <q-btn color="red" @click="Hello('WOrld! Tahgle!')"> Hello World</q-btn>
    <q-btn color="red" @click="Test('WOrld! Tahgle!')"> Test function</q-btn>
    <br>
    <div class="full-width" contenteditable="true" id="gx_repl" style="max-width: 300px; height: 25vh; border: 2px solid black;">
    534
   </div>
    <q-btn color="red" @click="sourceCodeRun('gx_repl')"> Repl </q-btn>
  </q-page>
</template>

<script>
import { Hello } from 'app/public/gxjs.js'
import { Test } from 'app/public/gambit-module-test.js'
import { Loading } from 'quasar'

export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      console.log(Hello)
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    },
    sourceCodeRun (id) {
      var scRun = false;
      (async () => {
        if (!scRun) {
          Loading.show()
          const { sourceCodeRun } = await import('app/public/gambit-repl.js')
          scRun = sourceCodeRun
          Loading.hide()
        }
        var val = scRun(id)
        alert('=> ' + val)
      })()
    }
  }
}
</script>
#+end_src

** ~MainLayout.vue~: Our links please!

Changing the layout to be more in line with gerbil.

We'll make a ~js~ file that exports our version.

#+begin_src shell :noweb-ref gxsv
_gx_sv=../public/gerbil-system-version.js
echo "Making a $_gx_sv file"
gxi -e '(import :std/format)' -e '(display (format "export default \"~a\"" (gerbil-system-version-string)))' |tee $_gx_sv
#+end_src

#+begin_src vue :tangle ../../src/layouts/MainLayout.vue
<template>
  <q-layout view="lHh Lpr lFf">
    <q-header elevated>
      <q-toolbar>
        <q-btn
          flat
          dense
          round
          icon="menu"
          aria-label="Menu"
          @click="leftDrawerOpen = !leftDrawerOpen"
        />

        <q-toolbar-title>
          gxQuasar: Gerbil and Quasar
        </q-toolbar-title>

        <div class="text-subtitle2">{{ gxVersion }} on Quasar v{{ $q.version }}</div>
      </q-toolbar>
    </q-header>

    <q-drawer
      v-model="leftDrawerOpen"
      show-if-above
      bordered
      content-class="bg-grey-1"
    >
      <q-list>
        <q-item-label
          header
          class="text-grey-8"
        >
          Essential Links
        </q-item-label>
        <EssentialLink
          v-for="link in essentialLinks"
          :key="link.title"
          v-bind="link"
        />
      </q-list>
    </q-drawer>

    <q-page-container>
      <router-view />
    </q-page-container>
  </q-layout>
</template>

<script>
import EssentialLink from 'components/EssentialLink.vue'
import { links } from 'app/public/gxjs.js'
import gxVersion from 'app/public/gerbil-system-version.js'
const linksData = links

export default {
  name: 'MainLayout',
  components: { EssentialLink },
  data () {
    return {
      leftDrawerOpen: false,
      essentialLinks: linksData,
      gxVersion: gxVersion
    }
  }
}
</script>
#+end_src


