log/0001_Make-It-Useful.html

<div id="outline-container-org4c8a767" class="outline-3">
<h3 id="org4c8a767"><span class="section-number-3">2.1</span> <code>gambit-module-test.ss</code>: A module not loaded in the gambit program</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #51afef;">declare</span> (extended-bindings))
(<span style="color: #51afef;">extern</span> <span style="color: #c678dd;">namespace:</span> <span style="color: #98be65;">"#"</span> alert console.log plist-&gt;jso)

(<span style="color: #c678dd;">##</span>inline-host-statement
 <span style="color: #98be65;">"exports.Test = (arg) =&gt; {</span>
<span style="color: #98be65;">   var hello_fn = g_scm2host(@1@)</span>
<span style="color: #98be65;">   hello_fn('Test' + arg)</span>
<span style="color: #98be65;">}</span>

<span style="color: #98be65;">console.log('init gambit-modilr-test');</span>

<span style="color: #98be65;">"</span>
 (<span style="color: #51afef;">lambda</span> (str)
   (<span style="color: #51afef;">let*</span> ((mod (<span style="color: #c678dd;">##</span>inline-host-expression <span style="color: #98be65;">"gx_gambit_module_table[1];"</span>))
          (name (<span style="color: #c678dd;">##</span>gambit-module-name mod)))
     (console.log mod)

     (alert str) (alert name))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge330598" class="outline-3">
<h3 id="orge330598"><span class="section-number-3">2.2</span> The new <code>Index.vue</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
This is what we end up with for the index page. Because we lazy-load gambit we want to inform the user of such. The <a href="https://quasar.dev/quasar-plugins/loading#Loading-API">Loading Plugin</a> for <b>Quasar</b> is good enough.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">quasar.conf.js</span>

<span style="color: #51afef;">return</span> {
  framework: {
    plugins: [
      <span style="color: #98be65;">'Loading'</span>
    ],
    config: {
      loading: {
        delay: <span style="color: #da8548; font-weight: bold;">300</span>,
        message: <span style="color: #98be65;">'Loading API...'</span>
      }
    }
  }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-vue">&lt;<span style="color: #c678dd;">template</span>&gt;
  &lt;<span style="color: #c678dd;">q-page</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"flex flex-center"</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Hello('WOrld! Tahgle!')"</span>&gt; Hello World&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"Test('WOrld! Tahgle!')"</span>&gt; Test function&lt;/<span style="color: #c678dd;">q-btn</span>&gt;
    &lt;<span style="color: #c678dd;">br</span>&gt;
    &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"full-width"</span> <span style="color: #dcaeea;">contenteditable</span>=<span style="color: #98be65;">"true"</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"gx_repl"</span> <span style="color: #dcaeea;">style</span>=<span style="color: #98be65;">"max-width: 300px; height: 25vh; border: 2px solid black;"</span>&gt;
    534
   &lt;/<span style="color: #c678dd;">div</span>&gt;
    &lt;<span style="color: #c678dd;">q-btn</span> <span style="color: #dcaeea;">color</span>=<span style="color: #98be65;">"red"</span> @click=<span style="color: #98be65;">"sourceCodeRun('gx_repl')"</span>&gt; Repl &lt;/<span style="color: #c678dd;">q-btn</span>&gt;
  &lt;/<span style="color: #c678dd;">q-page</span>&gt;
&lt;/<span style="color: #c678dd;">template</span>&gt;

&lt;<span style="color: #c678dd;">script</span>&gt;
import { Hello } from 'app/public/gxjs.js'
import { Test } from 'app/public/gambit-module-test.js'
import { Loading } from 'quasar'

export default {
  name: 'PageIndex',
  methods: {
    Hello (arg) {
      console.log(Hello)
      if (typeof Hello === 'function') { Hello('Hello: ' + arg) }
    },
    Test (arg) {
      console.log(Test)
      if (typeof Test === 'function') { Test('Test: ' + arg) }
    },
    sourceCodeRun (id) {
      var scRun = false;
      (async () =&gt; {
        if (!scRun) {
          Loading.show()
          const { sourceCodeRun } = await import('app/public/gambit-repl.js')
          scRun = sourceCodeRun
          Loading.hide()
        }
        var val = scRun(id)
        alert('=&gt; ' + val)
      })()
    }
  }
}
&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6988dcc" class="outline-3">
<h3 id="org6988dcc"><span class="section-number-3">2.3</span> <code>MainLayout.vue</code>: Our links please!</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Changing the layout to be more in line with gerbil.
</p>

<p>
We&rsquo;ll make a <code>js</code> file that exports our version.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #dcaeea;">_gx_sv</span>=../public/gerbil-system-version.js
<span style="color: #ECBE7B;">echo</span> <span style="color: #98be65;">"Making a $_gx_sv file"</span>
gxi -e <span style="color: #98be65;">'(import :std/format)'</span> -e <span style="color: #98be65;">'(display (format "export default \"~a\"" (gerbil-system-version-string)))'</span> |tee $<span style="color: #dcaeea;">_gx_sv</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-vue">&lt;<span style="color: #c678dd;">template</span>&gt;
  &lt;<span style="color: #c678dd;">q-layout</span> <span style="color: #dcaeea;">view</span>=<span style="color: #98be65;">"lHh Lpr lFf"</span>&gt;
    &lt;<span style="color: #c678dd;">q-header</span> elevated&gt;
      &lt;<span style="color: #c678dd;">q-toolbar</span>&gt;
        &lt;<span style="color: #c678dd;">q-btn</span>
          flat
          dense
          round
          <span style="color: #dcaeea;">icon</span>=<span style="color: #98be65;">"menu"</span>
          <span style="color: #dcaeea;">aria-label</span>=<span style="color: #98be65;">"Menu"</span>
          @click=<span style="color: #98be65;">"leftDrawerOpen = !leftDrawerOpen"</span>
        /&gt;

        &lt;<span style="color: #c678dd;">q-toolbar-title</span>&gt;
          gxQuasar: Gerbil and Quasar
        &lt;/<span style="color: #c678dd;">q-toolbar-title</span>&gt;

        &lt;<span style="color: #c678dd;">div</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"text-subtitle2"</span>&gt;{{ gxVersion }} on Quasar v{{ $q.version }}&lt;/<span style="color: #c678dd;">div</span>&gt;
      &lt;/<span style="color: #c678dd;">q-toolbar</span>&gt;
    &lt;/<span style="color: #c678dd;">q-header</span>&gt;

    &lt;<span style="color: #c678dd;">q-drawer</span>
      <span style="color: #dcaeea;">v-model</span>=<span style="color: #98be65;">"leftDrawerOpen"</span>
      show-if-above
      bordered
      <span style="color: #dcaeea;">content-class</span>=<span style="color: #98be65;">"bg-grey-1"</span>
    &gt;
      &lt;<span style="color: #c678dd;">q-list</span>&gt;
        &lt;<span style="color: #c678dd;">q-item-label</span>
          header
          <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"text-grey-8"</span>
        &gt;
          Essential Links
        &lt;/<span style="color: #c678dd;">q-item-label</span>&gt;
        &lt;<span style="color: #c678dd;">EssentialLink</span>
          <span style="color: #dcaeea;">v-for</span>=<span style="color: #98be65;">"link in essentialLinks"</span>
          :key=<span style="color: #98be65;">"link.title"</span>
          <span style="color: #dcaeea;">v-bind</span>=<span style="color: #98be65;">"link"</span>
        /&gt;
      &lt;/<span style="color: #c678dd;">q-list</span>&gt;
    &lt;/<span style="color: #c678dd;">q-drawer</span>&gt;

    &lt;<span style="color: #c678dd;">q-page-container</span>&gt;
      &lt;<span style="color: #c678dd;">router-view</span> /&gt;
    &lt;/<span style="color: #c678dd;">q-page-container</span>&gt;
  &lt;/<span style="color: #c678dd;">q-layout</span>&gt;
&lt;/<span style="color: #c678dd;">template</span>&gt;

&lt;<span style="color: #c678dd;">script</span>&gt;
import EssentialLink from 'components/EssentialLink.vue'
import { links } from 'app/public/gxjs.js'
import gxVersion from 'app/public/gerbil-system-version.js'
const linksData = links

export default {
  name: 'MainLayout',
  components: { EssentialLink },
  data () {
    return {
      leftDrawerOpen: false,
      essentialLinks: linksData,
      gxVersion: gxVersion
    }
  }
}
&lt;/<span style="color: #c678dd;">script</span>&gt;
</pre>
</div>
</div>
</div>
</div>
